weifengdq/embedded/tc364/tc364_lwip_iperf_gcc/Libraries/Infra/Sfr/TC36x/IfxGeth_bf.h
/**
 * \file IfxGeth_bf.h
 * \brief
 * \version iLLD_1_20_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC36XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Geth_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Geth_Registers
 * 
 */
#ifndef IFXGETH_BF_H
#define IFXGETH_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Geth_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.RE */
#define IFX_GETH_MAC_CONFIGURATION_RE_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.TE */
#define IFX_GETH_MAC_CONFIGURATION_TE_OFF (1u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.PRELEN */
#define IFX_GETH_MAC_CONFIGURATION_PRELEN_OFF (2u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DC */
#define IFX_GETH_MAC_CONFIGURATION_DC_OFF (4u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.BL */
#define IFX_GETH_MAC_CONFIGURATION_BL_OFF (5u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DR */
#define IFX_GETH_MAC_CONFIGURATION_DR_OFF (8u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DCRS */
#define IFX_GETH_MAC_CONFIGURATION_DCRS_OFF (9u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DO */
#define IFX_GETH_MAC_CONFIGURATION_DO_OFF (10u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.ECRSFD */
#define IFX_GETH_MAC_CONFIGURATION_ECRSFD_OFF (11u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.LM */
#define IFX_GETH_MAC_CONFIGURATION_LM_OFF (12u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_CONFIGURATION_Bits.DM */
#define IFX_GETH_MAC_CONFIGURATION_DM_OFF (13u)

/** \brief Length for Ifx_GETH_MAC_CONFIGURATION_Bits.FES */
#define IFX_GETH_MAC_CONFIGURATION_FES_LEN (1u)

