weifengdq/embedded/tc364/tc364_lwip_iperf_gcc/Libraries/Infra/Sfr/TC36x/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DOVLTC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DOVLTC */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DOVLTC_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERSVLM */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERSVLM_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.ERIVLT */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_ERIVLT_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHEN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHEN_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHN_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHN_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_TAG_FILTER_Bits.DMACHN */
#define IFX_GETH_MAC_VLAN_TAG_FILTER_DMACHN_OFF (25u)

/** \brief Length for Ifx_GETH_MAC_VLAN_HASH_TABLE_Bits.VLHT */
#define IFX_GETH_MAC_VLAN_HASH_TABLE_VLHT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_HASH_TABLE_Bits.VLHT */
#define IFX_GETH_MAC_VLAN_HASH_TABLE_VLHT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_HASH_TABLE_Bits.VLHT */
#define IFX_GETH_MAC_VLAN_HASH_TABLE_VLHT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_VLT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_VLT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_VLT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_VLAN_INCL_VLC_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_VLAN_INCL_VLC_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_VLAN_INCL_VLC_OFF (16u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_VLAN_INCL_VLP_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_VLAN_INCL_VLP_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.VLP */
#define IFX_GETH_MAC_VLAN_INCL_VLP_OFF (18u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_CSVL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_CSVL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_CSVL_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_VLAN_INCL_VLTI_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_VLAN_INCL_VLTI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.VLTI */
#define IFX_GETH_MAC_VLAN_INCL_VLTI_OFF (20u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.CBTI */
#define IFX_GETH_MAC_VLAN_INCL_CBTI_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.CBTI */
#define IFX_GETH_MAC_VLAN_INCL_CBTI_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.CBTI */
#define IFX_GETH_MAC_VLAN_INCL_CBTI_OFF (21u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.ADDR */
#define IFX_GETH_MAC_VLAN_INCL_ADDR_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.ADDR */
#define IFX_GETH_MAC_VLAN_INCL_ADDR_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.ADDR */
#define IFX_GETH_MAC_VLAN_INCL_ADDR_OFF (24u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.RDWR */
#define IFX_GETH_MAC_VLAN_INCL_RDWR_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.RDWR */
#define IFX_GETH_MAC_VLAN_INCL_RDWR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.RDWR */
#define IFX_GETH_MAC_VLAN_INCL_RDWR_OFF (30u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Bits.BUSY */
#define IFX_GETH_MAC_VLAN_INCL_BUSY_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Bits.BUSY */
#define IFX_GETH_MAC_VLAN_INCL_BUSY_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Bits.BUSY */
#define IFX_GETH_MAC_VLAN_INCL_BUSY_OFF (31u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_Q_VLT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_Q_VLT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.VLT */
#define IFX_GETH_MAC_VLAN_INCL_Q_VLT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_Q_CSVL_LEN (1u)

/** \brief Mask for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_Q_CSVL_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MAC_VLAN_INCL_Q_Bits.CSVL */
#define IFX_GETH_MAC_VLAN_INCL_Q_CSVL_OFF (19u)

/** \brief Length for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLT_LEN (16u)

/** \brief Mask for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLT */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLT_OFF (0u)

/** \brief Length for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLC_LEN (2u)

/** \brief Mask for Ifx_GETH_MAC_INNER_VLAN_INCL_Bits.VLC */
#define IFX_GETH_MAC_INNER_VLAN_INCL_VLC_MSK (0x3u)

