weifengdq/embedded/tc364/tc364_lwip_iperf_gcc/Libraries/Infra/Sfr/TC36x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_TX_UNDERFLOW_ERROR_PACKETS_Bits.TXUNDRFLW */
#define IFX_GETH_TX_UNDERFLOW_ERROR_PACKETS_TXUNDRFLW_OFF (0u)

/** \brief Length for Ifx_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_Bits.TXSNGLCOLG */
#define IFX_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_Bits.TXSNGLCOLG */
#define IFX_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_Bits.TXSNGLCOLG */
#define IFX_GETH_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_Bits.TXMULTCOLG */
#define IFX_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_Bits.TXMULTCOLG */
#define IFX_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_Bits.TXMULTCOLG */
#define IFX_GETH_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_DEFERRED_PACKETS_Bits.TXDEFRD */
#define IFX_GETH_TX_DEFERRED_PACKETS_TXDEFRD_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_DEFERRED_PACKETS_Bits.TXDEFRD */
#define IFX_GETH_TX_DEFERRED_PACKETS_TXDEFRD_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_DEFERRED_PACKETS_Bits.TXDEFRD */
#define IFX_GETH_TX_DEFERRED_PACKETS_TXDEFRD_OFF (0u)

/** \brief Length for Ifx_GETH_TX_LATE_COLLISION_PACKETS_Bits.TXLATECOL */
#define IFX_GETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_LATE_COLLISION_PACKETS_Bits.TXLATECOL */
#define IFX_GETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_LATE_COLLISION_PACKETS_Bits.TXLATECOL */
#define IFX_GETH_TX_LATE_COLLISION_PACKETS_TXLATECOL_OFF (0u)

/** \brief Length for Ifx_GETH_TX_EXCESSIVE_COLLISION_PACKETS_Bits.TXEXSCOL */
#define IFX_GETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_EXCESSIVE_COLLISION_PACKETS_Bits.TXEXSCOL */
#define IFX_GETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_EXCESSIVE_COLLISION_PACKETS_Bits.TXEXSCOL */
#define IFX_GETH_TX_EXCESSIVE_COLLISION_PACKETS_TXEXSCOL_OFF (0u)

/** \brief Length for Ifx_GETH_TX_CARRIER_ERROR_PACKETS_Bits.TXCARR */
#define IFX_GETH_TX_CARRIER_ERROR_PACKETS_TXCARR_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_CARRIER_ERROR_PACKETS_Bits.TXCARR */
#define IFX_GETH_TX_CARRIER_ERROR_PACKETS_TXCARR_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_CARRIER_ERROR_PACKETS_Bits.TXCARR */
#define IFX_GETH_TX_CARRIER_ERROR_PACKETS_TXCARR_OFF (0u)

/** \brief Length for Ifx_GETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_TXOCTG_LEN (32u)

/** \brief Mask for Ifx_GETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_TXOCTG_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_TX_OCTET_COUNT_GOOD_Bits.TXOCTG */
#define IFX_GETH_TX_OCTET_COUNT_GOOD_TXOCTG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_PACKET_COUNT_GOOD_Bits.TXPKTG */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_TXPKTG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_PACKET_COUNT_GOOD_Bits.TXPKTG */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_TXPKTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_PACKET_COUNT_GOOD_Bits.TXPKTG */
#define IFX_GETH_TX_PACKET_COUNT_GOOD_TXPKTG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_Bits.TXEXSDEF */
#define IFX_GETH_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_OFF (0u)

/** \brief Length for Ifx_GETH_TX_PAUSE_PACKETS_Bits.TXPAUSE */
#define IFX_GETH_TX_PAUSE_PACKETS_TXPAUSE_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_PAUSE_PACKETS_Bits.TXPAUSE */
#define IFX_GETH_TX_PAUSE_PACKETS_TXPAUSE_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_PAUSE_PACKETS_Bits.TXPAUSE */
#define IFX_GETH_TX_PAUSE_PACKETS_TXPAUSE_OFF (0u)

/** \brief Length for Ifx_GETH_TX_VLAN_PACKETS_GOOD_Bits.TXVLANG */
#define IFX_GETH_TX_VLAN_PACKETS_GOOD_TXVLANG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_VLAN_PACKETS_GOOD_Bits.TXVLANG */
#define IFX_GETH_TX_VLAN_PACKETS_GOOD_TXVLANG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_VLAN_PACKETS_GOOD_Bits.TXVLANG */
#define IFX_GETH_TX_VLAN_PACKETS_GOOD_TXVLANG_OFF (0u)

/** \brief Length for Ifx_GETH_TX_OSIZE_PACKETS_GOOD_Bits.TXOSIZG */
#define IFX_GETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_LEN (16u)

/** \brief Mask for Ifx_GETH_TX_OSIZE_PACKETS_GOOD_Bits.TXOSIZG */
#define IFX_GETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_TX_OSIZE_PACKETS_GOOD_Bits.TXOSIZG */
#define IFX_GETH_TX_OSIZE_PACKETS_GOOD_TXOSIZG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_PACKETS_COUNT_GOOD_BAD_Bits.RXPKTGB */
#define IFX_GETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_PACKETS_COUNT_GOOD_BAD_Bits.RXPKTGB */
#define IFX_GETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_PACKETS_COUNT_GOOD_BAD_Bits.RXPKTGB */
#define IFX_GETH_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_LEN (32u)

/** \brief Mask for Ifx_GETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RX_OCTET_COUNT_GOOD_BAD_Bits.RXOCTGB */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_OFF (0u)

/** \brief Length for Ifx_GETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_RXOCTG_LEN (32u)

/** \brief Mask for Ifx_GETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_RXOCTG_MSK (0xffffffffu)

/** \brief Offset for Ifx_GETH_RX_OCTET_COUNT_GOOD_Bits.RXOCTG */
#define IFX_GETH_RX_OCTET_COUNT_GOOD_RXOCTG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_BROADCAST_PACKETS_GOOD_Bits.RXBCASTG */
#define IFX_GETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_LEN (16u)

/** \brief Mask for Ifx_GETH_RX_BROADCAST_PACKETS_GOOD_Bits.RXBCASTG */
#define IFX_GETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RX_BROADCAST_PACKETS_GOOD_Bits.RXBCASTG */
#define IFX_GETH_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_OFF (0u)

/** \brief Length for Ifx_GETH_RX_MULTICAST_PACKETS_GOOD_Bits.RXMCASTG */
#define IFX_GETH_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_LEN (16u)

