weifengdq/embedded/tc364/tc364_lwip_iperf_gcc/Libraries/Infra/Sfr/TC36x/IfxGeth_bf.h
/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPEROIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXUDPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXUDPEROIS_OFF (25u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPGOIS_OFF (26u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPEROIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPEROIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXTCPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXTCPEROIS_OFF (27u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGOIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGOIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPGOIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPGOIS_OFF (28u)

/** \brief Length for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPEROIS_LEN (1u)

/** \brief Mask for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPEROIS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MMC_IPC_RX_INTERRUPT_Bits.RXICMPEROIS */
#define IFX_GETH_MMC_IPC_RX_INTERRUPT_RXICMPEROIS_OFF (29u)

/** \brief Length for Ifx_GETH_RXIPV4_GOOD_PACKETS_Bits.RXIPV4GDPKT */
#define IFX_GETH_RXIPV4_GOOD_PACKETS_RXIPV4GDPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV4_GOOD_PACKETS_Bits.RXIPV4GDPKT */
#define IFX_GETH_RXIPV4_GOOD_PACKETS_RXIPV4GDPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_GOOD_PACKETS_Bits.RXIPV4GDPKT */
#define IFX_GETH_RXIPV4_GOOD_PACKETS_RXIPV4GDPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_HEADER_ERROR_PACKETS_Bits.RXIPV4HDRERRPKT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_PACKETS_RXIPV4HDRERRPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV4_HEADER_ERROR_PACKETS_Bits.RXIPV4HDRERRPKT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_PACKETS_RXIPV4HDRERRPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_HEADER_ERROR_PACKETS_Bits.RXIPV4HDRERRPKT */
#define IFX_GETH_RXIPV4_HEADER_ERROR_PACKETS_RXIPV4HDRERRPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_NO_PAYLOAD_PACKETS_Bits.RXIPV4NOPAYPKT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_PACKETS_RXIPV4NOPAYPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV4_NO_PAYLOAD_PACKETS_Bits.RXIPV4NOPAYPKT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_PACKETS_RXIPV4NOPAYPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_NO_PAYLOAD_PACKETS_Bits.RXIPV4NOPAYPKT */
#define IFX_GETH_RXIPV4_NO_PAYLOAD_PACKETS_RXIPV4NOPAYPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_FRAGMENTED_PACKETS_Bits.RXIPV4FRAGPKT */
#define IFX_GETH_RXIPV4_FRAGMENTED_PACKETS_RXIPV4FRAGPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV4_FRAGMENTED_PACKETS_Bits.RXIPV4FRAGPKT */
#define IFX_GETH_RXIPV4_FRAGMENTED_PACKETS_RXIPV4FRAGPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_FRAGMENTED_PACKETS_Bits.RXIPV4FRAGPKT */
#define IFX_GETH_RXIPV4_FRAGMENTED_PACKETS_RXIPV4FRAGPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_Bits.RXIPV4UDSBLPKT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_RXIPV4UDSBLPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_Bits.RXIPV4UDSBLPKT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_RXIPV4UDSBLPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_Bits.RXIPV4UDSBLPKT */
#define IFX_GETH_RXIPV4_UDP_CHECKSUM_DISABLED_PACKETS_RXIPV4UDSBLPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_GOOD_PACKETS_Bits.RXIPV6GDPKT */
#define IFX_GETH_RXIPV6_GOOD_PACKETS_RXIPV6GDPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV6_GOOD_PACKETS_Bits.RXIPV6GDPKT */
#define IFX_GETH_RXIPV6_GOOD_PACKETS_RXIPV6GDPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_GOOD_PACKETS_Bits.RXIPV6GDPKT */
#define IFX_GETH_RXIPV6_GOOD_PACKETS_RXIPV6GDPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_HEADER_ERROR_PACKETS_Bits.RXIPV6HDRERRPKT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_PACKETS_RXIPV6HDRERRPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV6_HEADER_ERROR_PACKETS_Bits.RXIPV6HDRERRPKT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_PACKETS_RXIPV6HDRERRPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_HEADER_ERROR_PACKETS_Bits.RXIPV6HDRERRPKT */
#define IFX_GETH_RXIPV6_HEADER_ERROR_PACKETS_RXIPV6HDRERRPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXIPV6_NO_PAYLOAD_PACKETS_Bits.RXIPV6NOPAYPKT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_PACKETS_RXIPV6NOPAYPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXIPV6_NO_PAYLOAD_PACKETS_Bits.RXIPV6NOPAYPKT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_PACKETS_RXIPV6NOPAYPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXIPV6_NO_PAYLOAD_PACKETS_Bits.RXIPV6NOPAYPKT */
#define IFX_GETH_RXIPV6_NO_PAYLOAD_PACKETS_RXIPV6NOPAYPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXUDP_GOOD_PACKETS_Bits.RXUDPGDPKT */
#define IFX_GETH_RXUDP_GOOD_PACKETS_RXUDPGDPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXUDP_GOOD_PACKETS_Bits.RXUDPGDPKT */
#define IFX_GETH_RXUDP_GOOD_PACKETS_RXUDPGDPKT_MSK (0xffffu)

/** \brief Offset for Ifx_GETH_RXUDP_GOOD_PACKETS_Bits.RXUDPGDPKT */
#define IFX_GETH_RXUDP_GOOD_PACKETS_RXUDPGDPKT_OFF (0u)

/** \brief Length for Ifx_GETH_RXUDP_ERROR_PACKETS_Bits.RXUDPERRPKT */
#define IFX_GETH_RXUDP_ERROR_PACKETS_RXUDPERRPKT_LEN (16u)

/** \brief Mask for Ifx_GETH_RXUDP_ERROR_PACKETS_Bits.RXUDPERRPKT */
#define IFX_GETH_RXUDP_ERROR_PACKETS_RXUDPERRPKT_MSK (0xffffu)

