weifengdq/embedded/tc364/tc364_lwip_iperf_gcc/Libraries/Infra/Sfr/TC36x/IfxGeth_bf.h
/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.DIS_TCP_EF */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_DIS_TCP_EF_OFF (6u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_EHFC_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_EHFC_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.EHFC */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_EHFC_OFF (7u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFA_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFA_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFA */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFA_OFF (8u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFD_LEN (4u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFD_MSK (0xfu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RFD */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RFD_OFF (14u)

/** \brief Length for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RQS_LEN (5u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RQS_MSK (0x1fu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_OPERATION_MODE_Bits.RQS */
#define IFX_GETH_MTL_RXQ_OPERATION_MODE_RQS_OFF (20u)

/** \brief Length for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFPKTCNT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.OVFCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_OVFCNTOVF_OFF (11u)

/** \brief Length for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_LEN (11u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_MSK (0x7ffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISPKTCNT */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISPKTCNT_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_Bits.MISCNTOVF */
#define IFX_GETH_MTL_RXQ_MISSED_PACKET_OVERFLOW_CNT_MISCNTOVF_OFF (27u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RWCSTS_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RWCSTS_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RWCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RWCSTS_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RRCSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RRCSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RRCSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RRCSTS_OFF (1u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RXQSTS_LEN (2u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RXQSTS_MSK (0x3u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DEBUG_Bits.RXQSTS */
#define IFX_GETH_MTL_RXQ_DEBUG_RXQSTS_OFF (4u)

/** \brief Length for Ifx_GETH_MTL_RXQ_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ_DEBUG_PRXQ_LEN (14u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ_DEBUG_PRXQ_MSK (0x3fffu)

/** \brief Offset for Ifx_GETH_MTL_RXQ_DEBUG_Bits.PRXQ */
#define IFX_GETH_MTL_RXQ_DEBUG_PRXQ_OFF (16u)

/** \brief Length for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_WEGT_LEN (3u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_WEGT_MSK (0x7u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_WEGT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_WEGT_OFF (0u)

/** \brief Length for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_FRM_ARBIT_LEN (1u)

/** \brief Mask for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_FRM_ARBIT_MSK (0x1u)

/** \brief Offset for Ifx_GETH_MTL_RXQ_CONTROL_Bits.RXQ_FRM_ARBIT */
#define IFX_GETH_MTL_RXQ_CONTROL_RXQ_FRM_ARBIT_OFF (3u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.SWR */
#define IFX_GETH_DMA_MODE_SWR_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.SWR */
#define IFX_GETH_DMA_MODE_SWR_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.SWR */
#define IFX_GETH_DMA_MODE_SWR_OFF (0u)

/** \brief Length for Ifx_GETH_DMA_MODE_Bits.DA */
#define IFX_GETH_DMA_MODE_DA_LEN (1u)

/** \brief Mask for Ifx_GETH_DMA_MODE_Bits.DA */
#define IFX_GETH_DMA_MODE_DA_MSK (0x1u)

/** \brief Offset for Ifx_GETH_DMA_MODE_Bits.DA */
#define IFX_GETH_DMA_MODE_DA_OFF (1u)

